Функция ИННВерен (ИНН) Экспорт

	Если СтрДлина(ИНН) = 10	Тогда
		КонтрольнаяСумма = 0;
		Множители = СтрРазделить ("2,4,10,3,5,9,4,6,8",",",Ложь);
		
		Для К = 1 по 9 Цикл 
			КонтрольнаяСумма = КонтрольнаяСумма + Число(Сред(ИНН, К, 1)) * Множители [К-1];
		КонецЦикла;
		
		КонтрольныйРазряд = КонтрольнаяСумма%11;
		Если КонтрольныйРазряд = 10 Тогда
			КонтрольныйРазряд = 0;
		КонецЕсли;
		Если КонтрольныйРазряд = Число(Сред(ИНН,10,1)) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		Возврат Истина
	Иначе 
		Возврат Ложь
		КонецЕсли;
КонецФункции
