Процедура ПриНачалеРаботыСистемы()
    Сообщить("Приложение на платформе 1С:Предприятие 8 готово к работе");
	
	ДатаСегодня = ТекущаяДата();
	ФорматДатыСегодня = Формат(ДатаСегодня,"ДФ=dd.MM.yy");
	
	ДатаНачалаТекущегоДня = НачалоДня(ДатаСегодня);
	Часов = 9;
	Сдвиг = 9 * 60 * 60;
	НачалоРабочегоДня = ДатаНачалаТекущегоДня + Сдвиг; 
	СколькоПрошлоСекунд = ТекущаяДата() - НачалоРабочегоДня;
	СколькоПрошлоВМинутах = СколькоПрошлоСекунд / 60;
	ЦелыеМинуты = Цел (СколькоПрошлоВМинутах);
	ТекстСообщения = СтрШаблон("Сегодня: %1, Минут с начала рабочего дня: %2", ФорматДатыСегодня,ЦелыеМинуты);
	Сообщить (ТекстСообщения);  
	
//	ДатаСегодня = ТекущаяДата();
//	ДеньНеделиПрописью = Формат (ТекущаяДата(), "ДФ=dddd");
//	НачалоРабочегоДня = НачалоДня(ДатаСегодня) + 32400;
//	КонецРабочегоДня = НачалоДня(ДатаСегодня) + 64800;
//	ДеньНеделиСегодня = ДеньНедели (ДатаСегодня);
  //
//	Если ДатаСегодня >= НачалоРабочегоДня и ДатаСегодня <= КонецРабочегоДня Тогда
//		СостояниеРабочегоВремени = " Рабочее время идет" ;
//	КонецЕсли;
	
//	Если ДатаСегодня < КонецРабочегоДня Тогда
//		СостояниеРабочегоВремени = " Рабочее время завершилось" ;
//	КонецЕсли;
	
//	Если ДатаСегодня < НачалоРабочегоДня Тогда
//		СостояниеРабочегоВремени = " Рабочее время, еще не началось" ;
//	КонецЕсли;
	 	  
//	  Если ДеньНеделиСегодня = 6 или ДеньНеделиСегодня = 7 Тогда
//		  ТекстСообщения = СтрШаблон ( "Сегодня : %1,выходной день. %2 ",ДатаСегодня,СостояниеРабочегоВремени );
//	  Иначе ТекстСообщения = СтрШаблон ( "Сегодня : %1,будний день. %2 ",ДатаСегодня,СостояниеРабочегоВремени );
//	  КонецЕсли;
//	  Сообщить (ТекстСообщения); 

МассивПраздников = Новый Массив; 
Сегодня = НачалоДня(ТекущаяДата());
Завтра = Сегодня + 86400; 

Праздник = Новый Структура("День, Месяц, Название");
Праздник.Название = "День Кошек";
Праздник.Месяц = 8;
Праздник.День = 26;
МассивПраздников.Добавить(Праздник); 

Праздник.Название = "День Собак";
Праздник.Месяц = 8;
Праздник.День = 27;
МассивПраздников.Добавить(Праздник);


Для Каждого Праздник Из МассивПраздников Цикл
	
	Если День(Сегодня) = Праздник.День И Месяц(Сегодня) = Праздник.Месяц Тогда
		Сообщить(СтрШаблон("Сегодня праздник: %1", Праздник.Название));
	ИначеЕсли День(Завтра) = Праздник.День И Месяц(Завтра) = Праздник.Месяц Тогда
		Сообщить(СтрШаблон("Завтра праздник: %1", Праздник.Название));
	КонецЕсли;
КонецЦикла;

   ДеньРожденияСотрудника = СотрудникиВызовСервера.ДатаРожденияТекущегоПользователя();   
   Если День (ДатаСегодня) = День (ДеньРожденияСотрудника) и Месяц (ДатаСегодня) = Месяц (ДеньРожденияСотрудника) Тогда
   Сообщить ("Поздравляем С Днем Рождения!")
	   КонецЕсли;


	Сообщить(Формат(ТекущаяДата(), "ДФ=HH:mm:ss;"));
КонецПроцедуры;     
