Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)  
	
	Если Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		// Проверка ИНН для юридического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 10 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица ИНН должен быть заполнен и иметь длину 10 знаков'");
			Сообщить(ТекстСообщения); 
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		// Проверка КПП для юридического лица
		Если НЕ ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для юридического лица КПП должен быть заполнен и иметь длину 9 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(КПП) Тогда // Проверка символов КПП
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'КПП должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		// Проверка ИНН для физического лица
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН) <> 12 Тогда    
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица ИНН должен быть заполнен и иметь длину 12 знаков'");
			Сообщить(ТекстСообщения);
		ИначеЕсли НЕ ТолькоЦифрыВСтроке(ИНН) Тогда // Проверка символов ИНН
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'ИНН должен состоять только из цифр'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		// Проверка КПП для физического лица
		Если ЗначениеЗаполнено(КПП) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'для физического лица КПП должен быть не заполнен'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Если РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда
		Отказ = Истина;
		Сообщить ("Проверка ИНН не пройдена");
		КонецЕсли;
		
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответсвенный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Функция ТолькоЦифрыВСтроке(Знач ПроверяемаяСтрока) 
 
	// Строка, содержащая только цифры.
	// Определяем строку, содержащую все цифры, для проверки символов ИНН и КПП.
	Цифры = "0123456789";
	
	Для Счетчик = 1 По СтрДлина(ПроверяемаяСтрока) Цикл
		
		// Получаем каждый символ проверямой строки с помощью цикла и функции Сред().
		Символ = Сред(ПроверяемаяСтрока, Счетчик, 1);
		
		// Если символ не является цифрой (проверка с помощью СтрНайти()), прекращаем выполнение проверки и сразу возвращаем ложь
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЦикла;
	
	// По умолчанию считаем что, проверяемая строка содержит только цифры
	Возврат Истина;

КонецФункции